In [18]:
%matplotlib notebook

In [19]:
# Import dependencies

import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import os
import time
import json
import csv

In [20]:
# Import CSV file
path = "college_data.csv"
college_data = pd.read_csv(path, encoding='utf-8')
college_data_df = pd.DataFrame(college_data)
college_data_df.head()

,Year,College_names,College_state,In_state_tuition,Out_of_state_tuition,Admissions_rate_overall,Enrollment,Student Size
0,2002,"""Washington State University""","""WA""",4520,12270,0.7708,5100,4406
1,2003,"""Washington State University""","""WA""",5280,13382,0.7798,6037,4590
2,2004,"""Washington State University""","""WA""",5628,14046,0.7529,5368,4728
3,2005,"""Washington State University""","""WA""",5980,14985,0.7389,22177,19078
4,2006,"""Washington State University""","""WA""",6448,16088,0.7706,22444,18995

In [21]:
college_data_df["Year"] = college_data_df["Year"].astype('object')
college_data_df.dtypes

Year                        object
College_names               object
College_state               object
In_state_tuition             int64
Out_of_state_tuition         int64
Admissions_rate_overall    float64
Enrollment                   int64
Student Size                 int64
dtype: object

In [22]:
college_data_df[["College_names","College_state"]] = college_data_df[["College_names","College_state"]].replace(
    '"', '', regex=True)
college_data_df.head()

,Year,College_names,College_state,In_state_tuition,Out_of_state_tuition,Admissions_rate_overall,Enrollment,Student Size
0,2002,Washington State University,WA,4520,12270,0.7708,5100,4406
1,2003,Washington State University,WA,5280,13382,0.7798,6037,4590
2,2004,Washington State University,WA,5628,14046,0.7529,5368,4728
3,2005,Washington State University,WA,5980,14985,0.7389,22177,19078
4,2006,Washington State University,WA,6448,16088,0.7706,22444,18995

In [23]:
college_df_sorted = college_data_df.sort_values(["College_names","Year"],ascending = (True))
college_df_sorted

,Year,College_names,College_state,In_state_tuition,Out_of_state_tuition,Admissions_rate_overall,Enrollment,Student Size
34,2002,Arizona State University-Tempe,AZ,2585,11105,0.8474,40807,35573
35,2003,Arizona State University-Tempe,AZ,3595,12115,0.8840,42330,37336
36,2004,Arizona State University-Tempe,AZ,4064,12919,0.8610,43920,38117
37,2005,Arizona State University-Tempe,AZ,4406,15095,0.9102,45120,39649
38,2006,Arizona State University-Tempe,AZ,4688,15847,0.9242,47631,38984
...,...,...,...,...,...,...,...,...
12,2014,Washington State University,WA,12428,25510,0.8208,25967,23585
13,2015,Washington State University,WA,11967,25567,0.7964,26752,24100
14,2016,Washington State University,WA,11041,25673,0.7204,27313,24362
15,2017,Washington State University,WA,11391,25817,0.7306,27917,24797
16,2018,Washington State University,WA,11584,25820,0.7719,28198,25675

In [24]:

college_df_sorted = college_df_sorted.rename(columns={'Student Size': 'Student_size'})


college_df_sorted['%_In_state_chng'] = college_df_sorted.groupby('College_names').In_state_tuition.pct_change()
college_df_sorted['%_Out_of_state_chng'] = college_df_sorted.groupby('College_names').Out_of_state_tuition.pct_change()
college_df_sorted['%_admissions_rate_chng'] = college_df_sorted.groupby('College_names').Admissions_rate_overall.pct_change()
college_df_sorted['%_Student_size_chng'] = college_df_sorted.groupby('College_names').Student_size.pct_change()

college_df_sorted.head()

,Year,College_names,College_state,In_state_tuition,Out_of_state_tuition,Admissions_rate_overall,Enrollment,Student_size,%_In_state_chng,%_Out_of_state_chng,%_admissions_rate_chng,%_Student_size_chng
34,2002,Arizona State University-Tempe,AZ,2585,11105,0.8474,40807,35573,NaN,NaN,NaN,NaN
35,2003,Arizona State University-Tempe,AZ,3595,12115,0.8840,42330,37336,0.390716,0.090950,0.043191,0.049560
36,2004,Arizona State University-Tempe,AZ,4064,12919,0.8610,43920,38117,0.130459,0.066364,-0.026018,0.020918
37,2005,Arizona State University-Tempe,AZ,4406,15095,0.9102,45120,39649,0.084154,0.168434,0.057143,0.040192
38,2006,Arizona State University-Tempe,AZ,4688,15847,0.9242,47631,38984,0.064004,0.049818,0.015381,-0.016772

## Start graphing !!!

In [31]:
# In state vs Out of state scatterplot and regressions
tuition_df = college_df_sorted.loc[(college_df_sorted['Year'] > 2002)]
# tuition_df

In [23]:
# in_state_grouped = tuition_df.groupby(["College_names"])
# mean_school_tuition = tuition_df.groupby(['College_names']).mean()['%_In_state_chng']
# in_state_tuition_changes = pd.DataFrame ({'%_In_state_chng':mean_school_tuition
#                                })
# # in_state_tuition_changes.head()

in_state_grouped = tuition_df.groupby(["College_names"])
mean_in_state_tuition = tuition_df.groupby(['College_names']).mean()['Out_of_state_tuition'].map("${:,.0f}".format)
avg_in_state_tuition = pd.DataFrame ({'Average_Out_of_state_tuition':mean_in_state_tuition
                               })
avg_in_state_tuition.head()

                                  Average_Out_of_state_tuition
College_names
Arizona State University-Tempe                         $20,765
Oregon State University                                $22,382
Stanford University                                    $40,077
University of Arizona                                  $23,983
University of California-Berkeley                      $32,524

In [24]:
# mean_school_tuition = tuition_df.groupby(['College_names']).mean()['%_Out_of_state_chng']
# out_of_state_tuition_changes = pd.DataFrame ({'%_Out_of_state_chng':mean_school_tuition
#                                })
# # out_of_state_tuition_changes.head()

mean_out_of_state_tuition = tuition_df.groupby(['College_names']).mean()['In_state_tuition'].map("${:,.0f}".format)
avg_out_of_state_tuition = pd.DataFrame ({'Average_In_state_tuition':mean_out_of_state_tuition
                               })
avg_out_of_state_tuition.head()

                                  Average_In_state_tuition
College_names
Arizona State University-Tempe                      $7,748
Oregon State University                             $7,677
Stanford University                                $40,077
University of Arizona                               $8,224
University of California-Berkeley                  $10,459

In [34]:
# Combine the data into a single dataset
school_tuition_df=pd.merge(avg_in_state_tuition,avg_out_of_state_tuition,how = 'inner',on='College_names')
# Display the data table for preview
school_tuition_df.head(20)

,Average_Out_of_state_tuition,Average_In_state_tuition
College_names,,
Arizona State University-Tempe,"$20,765","$7,748"
Oregon State University,"$22,382","$7,677"
Stanford University,"$40,077","$40,077"
University of Arizona,"$23,983","$8,224"
University of California-Berkeley,"$32,524","$10,459"
University of California-Los Angeles,"$32,217","$10,174"
University of Colorado Boulder,"$29,192","$8,546"
University of Oregon,"$25,649","$8,296"
University of Southern California,"$42,107","$42,107"
University of Utah,"$20,301","$6,431"
University of Washington-Seattle Campus,"$27,176","$8,997"
Washington State University,"$20,977","$9,349"

In [53]:
schools_combine = tuition_df[(tuition_df['College_names']=='Arizona State University-Tempe')|
                     (tuition_df['College_names']=='Oregon State University')|
                     (tuition_df['College_names']=='Stanford University')|
                     (tuition_df['College_names']=='University of Arizona')|
                     (tuition_df['College_names']=='University of California-Berkeley')|
                     (tuition_df['College_names']=='University of California-Los Angeles')|
                     (tuition_df['College_names']=='University of Colorado Boulder')|
                     (tuition_df['College_names']=='University of Oregon')|
                     (tuition_df['College_names']=='University of Southern California')|
                     (tuition_df['College_names']=='University of Utah')|
                     (tuition_df['College_names']=='University of Washington-Seattle Campus')|
                     (tuition_df['College_names']=='Washington State University')]

schools_combine = schools_combine[['Year','College_names','College_state','In_state_tuition','Out_of_state_tuition','Admissions_rate_overall','Enrollment','Student_size','%_In_state_chng','%_Out_of_state_chng','%_admissions_rate_chng','%_Student_size_chng']]

schools_combine = schools_combine.groupby(['College_names'])

schools_in_tuition_avg = schools_combine['In_state_tuition'].mean().rename('Avg In State Tuition').map("${:,.0f}".format)
schools_in_tuition_std_dv = schools_combine['In_state_tuition'].std().rename('In State Tuition Std Deviation').map("${:,.0f}".format)
schools_in_tuition_variance = schools_combine['In_state_tuition'].var().rename('In State Tuition Variance').map("${:,.0f}".format)
schools_in_tuition_sem = schools_combine['In_state_tuition'].sem().rename('In State Tuition SEM').map("${:,.0f}".format)

schools_out_tuition_avg = schools_combine['Out_of_state_tuition'].mean().rename('Avg Out of State Tuition').map("${:,.0f}".format)
schools_out_tuition_std_dv = schools_combine['Out_of_state_tuition'].std().rename('Out of State Tuition Std Deviation').map("${:,.0f}".format)
schools_out_tuition_variance = schools_combine['Out_of_state_tuition'].var().rename('Out of State Tuition Variance').map("${:,.0f}".format)
schools_out_tuition_sem = schools_combine['Out_of_state_tuition'].sem().rename('Out of State Tuition SEM').map("${:,.0f}".format)

schools_student_sum = schools_combine['Student_size'].sum().rename('Sum of Student Size').map('{:.0f}'.format)
schools_student_mean = schools_combine['Student_size'].mean().rename('Avg Student Size').map('{:.0f}'.format)
schools_student_std_dv = schools_combine['Student_size'].std().rename('Student SizeStd Deviation').map('{:.0f}'.format)
schools_student_variance = schools_combine['Student_size'].var().rename('Student Size Variance').map('{:.0f}'.format)
schools_student_sem = schools_combine['Student_size'].sem().rename('Student Size SEM').map('{:.0f}'.format)

summary_by_school_df = pd.DataFrame({'Avg In State Tuition':schools_in_tuition_avg,
                           'In State Tuition Std Deviation':schools_in_tuition_std_dv,
                           'In State Tuition Variance':schools_in_tuition_variance,
                           'In State Tuition SEM':schools_in_tuition_sem,
                           'Avg Out of State Tuition':schools_out_tuition_avg,
                           'Out of State Tuition Std Deviation':schools_out_tuition_std_dv,
                           'Out of State Tuition Variance':schools_out_tuition_variance,
                           'Out of State Tuition SEM':schools_out_tuition_sem,
                           'Sum of Student Size':schools_student_sum,
                           'Avg Student Size':schools_student_mean,
                           'Student SizeStd Deviation':schools_student_std_dv,
                           'Student Size Variance':schools_student_variance,
                           'Student Size SEM':schools_student_sem
                          })
summary_by_school_df

,Avg In State Tuition,In State Tuition Std Deviation,In State Tuition Variance,In State Tuition SEM,Avg Out of State Tuition,Out of State Tuition Std Deviation,Out of State Tuition Variance,Out of State Tuition SEM,Sum of Student Size,Avg Student Size,Student SizeStd Deviation,Student Size Variance,Student Size SEM
College_names,,,,,,,,,,,,,
Arizona State University-Tempe,"$7,748","$2,755","$7,589,574",$689,"$20,765","$5,172","$26,752,666","$1,293",719019,44939,8022,64349806,2005
Oregon State University,"$7,677","$2,112","$4,460,017",$528,"$22,382","$4,789","$22,932,269","$1,197",314396,19650,3788,14352535,947
Stanford University,"$40,077","$7,159","$51,253,687","$1,790","$40,077","$7,159","$51,253,687","$1,790",109083,6818,254,64678,64
University of Arizona,"$8,224","$3,226","$10,407,862",$807,"$23,983","$8,396","$70,485,363","$2,099",489067,30567,2156,4646341,539
University of California-Berkeley,"$10,459","$3,220","$10,370,605",$805,"$32,524","$7,075","$50,048,928","$1,769",417211,26076,2456,6031444,614
University of California-Los Angeles,"$10,174","$3,000","$9,002,971",$750,"$32,217","$6,828","$46,626,739","$1,707",442652,27666,2268,5144930,567
University of Colorado Boulder,"$8,546","$2,776","$7,708,504",$694,"$29,192","$5,424","$29,422,355","$1,356",420342,26271,1269,1610677,317
University of Oregon,"$8,296","$2,360","$5,571,289",$590,"$25,649","$6,813","$46,421,345","$1,703",294782,18424,1830,3348069,457
University of Southern California,"$42,107","$8,686","$75,451,537","$2,172","$42,107","$8,686","$75,451,537","$2,172",278448,17403,1152,1327525,288
University of Utah,"$6,431","$1,830","$3,348,299",$457,"$20,301","$5,932","$35,189,473","$1,483",355818,22239,1115,1244126,279
University of Washington-Seattle Campus,"$8,997","$2,840","$8,065,610",$710,"$27,176","$6,755","$45,633,793","$1,689",452661,28291,1756,3084497,439
Washington State University,"$9,349","$2,687","$7,221,379",$672,"$20,977","$4,751","$22,572,978","$1,188",321148,20072,6336,40147256,1584

In [55]:
schools_combine = tuition_df[(tuition_df['College_names']=='Arizona State University-Tempe')|
                     (tuition_df['College_names']=='Oregon State University')|
                     (tuition_df['College_names']=='Stanford University')|
                     (tuition_df['College_names']=='University of Arizona')|
                     (tuition_df['College_names']=='University of California-Berkeley')|
                     (tuition_df['College_names']=='University of California-Los Angeles')|
                     (tuition_df['College_names']=='University of Colorado Boulder')|
                     (tuition_df['College_names']=='University of Oregon')|
                     (tuition_df['College_names']=='University of Southern California')|
                     (tuition_df['College_names']=='University of Utah')|
                     (tuition_df['College_names']=='University of Washington-Seattle Campus')|
                     (tuition_df['College_names']=='Washington State University')]

schools_combine = schools_combine[['Year','College_names','College_state','In_state_tuition','Out_of_state_tuition','Admissions_rate_overall','Enrollment','Student_size','%_In_state_chng','%_Out_of_state_chng','%_admissions_rate_chng','%_Student_size_chng']]

schools_combine = schools_combine.groupby(['Year'])

schools_in_tuition_avg = schools_combine['In_state_tuition'].mean().rename('Avg In State Tuition').map("${:,.0f}".format)
schools_in_tuition_std_dv = schools_combine['In_state_tuition'].std().rename('In State Tuition Std Deviation').map("${:,.0f}".format)
schools_in_tuition_variance = schools_combine['In_state_tuition'].var().rename('In State Tuition Variance').map("${:,.0f}".format)
schools_in_tuition_sem = schools_combine['In_state_tuition'].sem().rename('In State Tuition SEM').map("${:,.0f}".format)

schools_out_tuition_avg = schools_combine['Out_of_state_tuition'].mean().rename('Avg Out of State Tuition').map("${:,.0f}".format)
schools_out_tuition_std_dv = schools_combine['Out_of_state_tuition'].std().rename('Out of State Tuition Std Deviation').map("${:,.0f}".format)
schools_out_tuition_variance = schools_combine['Out_of_state_tuition'].var().rename('Out of State Tuition Variance').map("${:,.0f}".format)
schools_out_tuition_sem = schools_combine['Out_of_state_tuition'].sem().rename('Out of State Tuition SEM').map("${:,.0f}".format)

schools_student_sum = schools_combine['Student_size'].sum().rename('Sum of Student Size').map('{:.0f}'.format)
schools_student_mean = schools_combine['Student_size'].mean().rename('Avg Student Size').map('{:.0f}'.format)
schools_student_std_dv = schools_combine['Student_size'].std().rename('Student SizeStd Deviation').map('{:.0f}'.format)
schools_student_variance = schools_combine['Student_size'].var().rename('Student Size Variance').map('{:.0f}'.format)
schools_student_sem = schools_combine['Student_size'].sem().rename('Student Size SEM').map('{:.0f}'.format)

summary_by_Year_df = pd.DataFrame({'Avg In State Tuition':schools_in_tuition_avg,
                           'In State Tuition Std Deviation':schools_in_tuition_std_dv,
                           'In State Tuition Variance':schools_in_tuition_variance,
                           'In State Tuition SEM':schools_in_tuition_sem,
                           'Avg Out of State Tuition':schools_out_tuition_avg,
                           'Out of State Tuition Std Deviation':schools_out_tuition_std_dv,
                           'Out of State Tuition Variance':schools_out_tuition_variance,
                           'Out of State Tuition SEM':schools_out_tuition_sem,
                           'Sum of Student Size':schools_student_sum,
                           'Avg Student Size':schools_student_mean,
                           'Student SizeStd Deviation':schools_student_std_dv,
                           'Student Size Variance':schools_student_variance,
                           'Student Size SEM':schools_student_sem
                          })
summary_by_Year_df

,Avg In State Tuition,In State Tuition Std Deviation,In State Tuition Variance,In State Tuition SEM,Avg Out of State Tuition,Out of State Tuition Std Deviation,Out of State Tuition Variance,Out of State Tuition SEM,Sum of Student Size,Avg Student Size,Student SizeStd Deviation,Student Size Variance,Student Size SEM
Year,,,,,,,,,,,,,
2003,"$8,652","$9,365","$87,698,478","$2,703","$18,079","$5,867","$34,427,491","$1,694",247550,20629,9317,86802078,2690
2004,"$9,325","$9,785","$95,746,338","$2,825","$19,499","$6,347","$40,283,756","$1,832",246126,20510,9331,87065507,2694
2005,"$9,787","$10,218","$104,416,821","$2,950","$20,526","$6,428","$41,320,311","$1,856",262089,21841,8176,66851353,2360
2006,"$10,310","$10,829","$117,276,376","$3,126","$21,604","$6,745","$45,490,825","$1,947",262613,21884,8126,66037837,2346
2007,"$11,017","$11,440","$130,883,404","$3,303","$22,910","$7,053","$49,745,646","$2,036",265098,22092,8120,65930818,2344
2008,"$11,704","$11,960","$143,039,408","$3,453","$24,245","$7,270","$52,859,738","$2,099",284958,23746,11196,125356895,3232
2009,"$12,790","$12,247","$149,988,760","$3,535","$26,393","$7,433","$55,245,826","$2,146",294208,24517,11434,130742806,3301
2010,"$13,964","$12,512","$156,541,472","$3,612","$27,944","$7,649","$58,514,632","$2,208",297564,24797,11653,135781104,3364
2011,"$15,278","$12,699","$161,252,309","$3,666","$29,524","$7,746","$59,994,628","$2,236",305336,25445,12019,144461264,3470
2012,"$15,897","$12,961","$167,981,046","$3,741","$30,628","$7,505","$56,331,432","$2,167",310659,25888,12175,148241495,3515
2013,"$16,367","$13,490","$181,986,816","$3,894","$31,572","$7,658","$58,649,117","$2,211",292699,24392,7714,59510594,2227
2014,"$16,896","$14,040","$197,108,429","$4,053","$32,770","$7,689","$59,115,896","$2,220",299032,24919,8038,64607000,2320
2015,"$17,320","$14,559","$211,958,857","$4,203","$34,245","$7,898","$62,373,827","$2,280",304031,25336,8402,70599621,2426
2016,"$17,647","$15,245","$232,421,096","$4,401","$35,527","$8,391","$70,402,227","$2,422",309825,25819,8732,76241619,2521
2017,"$18,337","$15,781","$249,036,373","$4,556","$36,649","$8,870","$78,675,845","$2,561",314318,26193,8802,77476006,2541
2018,"$18,824","$16,413","$269,380,432","$4,738","$37,684","$9,274","$86,007,308","$2,677",318521,26543,8927,79690265,2577